программа 1
Написать программу которая заменяет все четные числа в целочисленном статическом массиве на 0

#include <iostream>
#include <string>
using namespace std;
#define RAZ 9


int main()
{
    int a[RAZ] = {                    
        97, 2, 3,4,5,6,7,8,9 }; //массив
    for (int i = 0; i < RAZ; i++) {   //цикл
        if (a[i] % 2 == 0) // проверка на четность
            a[i] = 0; // замена
    }
    printf("\n");
    for (int i = 0; i < RAZ; i++) {
        cout << a[i] << endl;//вывод массива
    }       
    return 0;
}


программа 2
Вывод символа с клавиатуры( с проверкой что это именно символ (цифра или буква латинского алфавита)) ввод строки с клавиатуры( с проверкой что это именно строка( длина более одного символа)) вывод в консоль номера, которой символ занимает в строке если он там есть

#include <iostream>
#include <string>
#define _CRT_SECURE_NO_WARNINGS
using namespace std;

int main()
{

    system("chcp 1251"); // Текущая кодовая страница 1251
    system("cls"); //вызывает команду cls (очистка экрана)
    char k; //тип-символ
    cout << "Введите символ:" << endl; //вывод на экран
    cin >> k; //ввод
    if (((k < '0') || (k > '9')) && ((k < 'a') || (k > 'z'))) { //условие
        cout << "Ошибка ввода!"; //вывод на экран
        return 4;
    }
    string name;
    cout << "Введите строку" << endl;
    cin >> name;
    int s = size(name);
    if (s < 2) {
        cout << "Ошибка ввода!";
        return 4;
    }
    printf("\n");
    cout << "Номер(а), которые символ занимает в строке" << endl;
    int q = 0;
    for (int i = 1; i < strlen(name.c_str())+1; i++)
    {
        if (name[i-1] == k) {
            q = i; //q-принимает новое значение

            cout << q  << " "; //вывод q
        }
    }
    if (q == 0) {

        cout << "Символ отсутствует!" << endl;
    }
    return 0;
}

программа 3
Расчёт определителя матрицы, матрица размером 3 на 3. Ввод чисел построчно. Числа только целые

#include <iostream>
#include <string>

using namespace std;
#define A 3 //директива определяющая идентификатор
#define B 3


int main()
{
    system("chcp 1251");
    system("cls");
    cout << "Введите элементы матрицы:" << endl;
    int a[A][B]; 
    for (int i = 0; i < A; i++) {
        for (int j = 0; j < B; j++) {
            cin >> a[i][j]; //ввод элементов матрицы
        }
    }
    printf("\n");
    for (int i = 0; i < A; i++) {
        for (int j = 0; j < B; j++) {
            cout << a[i][j];
        }
        printf("\n");
    }
    int opr = a[0][0] * a[1][1] * a[2][2] + a[0][1] * a[1][2] * a[2][0] + a[0][2] * a[1][0] * a[2][1] - a[2][0] * a[1][1]*a[0][2]-a[1][0]*a[0][1]*a[2][2]-a[0][0]*a[2][1]*a[1][2]; //формула для вычисления определителя
    cout << "Определитель матрицы:" << endl;
    cout << opr << endl;
    return 0;
}